export const generateDailySummary = (points) => {
    if (points === 0) {
        return "זה בסדר שיהיו גם ימים פחות עמוסים, שכן מנוחה חיונית להצלחה ארוכת טווח. מחר מחכה לך התחלה חדשה כדי להתמקד שוב ולהמשיך לבנות את המומנטום שלך.";
    } else if (points >= 1 && points <= 50) {
        return `רשמת התקדמות משמעותית היום וצברת ${points} נקודות. כל צעד קטן שביצעת מקרב אותך צעד נוסף אל עבר המטרות שלך.`;
    } else {
        return `הגעת היום לרמת פריון יוצאת דופן עם ${points} נקודות. ההישגים המרשימים האלו מוכיחים בדיוק למה יש לך יכולת כשמשימות ברורות עומדות לנגד עיניך!`;
    }
};
